Repository: EiffelSoftware/EiffelStudio
Catalog: Src/experimental/library/i18n/example_application/po_files/*.po
Languages: ru_ru

source: Members of the team: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang
ru_ru: члены team: - leo Fellmann - Etienne Reichenbach - BerndSchoeller - Martino Trosi - Hong Zhang

source: Application
ru_ru: применение

source: Demo application made by i18n Team ETHZ For bugs, suggestions or other, please write a mail to: es-i18n@origo.ethz.ch
ru_ru: применение Demo сделанное черепашками ETHZ For команды i18n, предложениями или другим, пожалуйста пишет почту к: es-i18n@origo.ethz.ch

source: Full date-time: $1
ru_ru: вполне date-time: $1

source: Update date and time
ru_ru: дата и время уточнения

source: Buy a hovercraft
ru_ru: купите ховеркрафт

source: arabic
ru_ru: арабско [ar]

source: italian
ru_ru: итальянско [it]

source: greek
ru_ru: греческо [gr]

source: hebrew
ru_ru: древнееврейско [he]

source: japanese
ru_ru: японско [ja]

source: russian
ru_ru: русско [ru]

source: chinese
ru_ru: китайско [zh]

source: english
ru_ru: английско [en]

source: hungarian
ru_ru: венгерско [hu]

source: Unknown
ru_ru: Неизвестно

source: Your have $1 on your bank conto
ru_ru: ваш имейте $1 на вашем conto крена

source: The mortage rate is $1%
ru_ru: ставкаа процента по закладной $1%

source: File
ru_ru: Архив

source: Select language
ru_ru: отборный язык

source: Time: $1
ru_ru: время: $1

source: sell hovercraft
ru_ru: ховеркрафт надувательства

source: Date: $1
ru_ru: дата: $1

source: About Dialog
ru_ru: О Диалоге

source: OK
ru_ru: о'кейо

source: My hovercraft is full of eels
ru_ru: мой ховеркрафт полн eels

source: About
ru_ru: о

source: You can sell a hovercraft for $1
ru_ru: вы можете продать ховеркрафт для $1

source: This string is written in the application's sourcecode
ru_ru: Russian is a language that has 4 different pluralforms
