Repository: EiffelSoftware/EiffelStudio
Catalog: Src/compatible/library/i18n/example_application/po_files/*.po
Languages: fr

source: Members of the team: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang
fr: Membres de l'équipe: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang

source: Demo application made by i18n Team ETHZ For bugs, suggestions or other, please write a mail to: es-i18n@origo.ethz.ch
fr: Application de démonstration faite par l'equipe i18n de l'ETHZ Pour signaler bugs, suggestions ou autre, yous pouvez envoyer un mail à es-i18n@origo.ethz.ch

source: french
fr: français [fr_FR]

source: Full date-time: $1
fr: Temps et date complets: $1

source: Update date and time
fr: Mettre à jour temps et date

source: A hovercraft costs you: $1
fr: Un aéroglisseur vous coûte: $1

source: Buy a hovercraft
fr: Acheter un aéroglisseur

source: english
fr: anglais [en]

source: Your have $1 on your bank conto
fr: Vous avez $1 sur votre compte bancaire

source: chinese
fr: chinois [zh_CN]

source: The mortage rate is $1%
fr: Le taux d'hypothèquage est d'$1%

source: File
fr: Fichier

source: greek
fr: grec [gr_GR]

source: Select language
fr: Choisir langue

source: arabic
fr: arabe [ar_SA]

source: hebrew
fr: hébreu [he_IL]

source: Time: $1
fr: Temps: $1

source: italian
fr: italien [it_IT]

source: sell hovercraft
fr: Vendre aéroglisseur

source: japanese
fr: japonais [ja_JA]

source: russian
fr: russe [ru_RU]

source: hungarian
fr: hongrois [hu]

source: Unknown
fr: Inconnu

source: About Dialog
fr: Dialogue d'informations

source: My hovercraft is full of eels
fr: Mon aéroglisseur est rempli d'anguilles.

source: About
fr: Informations

source: You can sell a hovercraft for $1
fr: Vous pouvez vendre un aéroglisseur pour $1

source: This string is written in the application's sourcecode
fr: full french translation
