Repository: EiffelSoftware/EiffelStudio
Catalog: Src/library/i18n/example_application/po_files/*.po
Languages: el_gr, hu, it_it

source: Members of the team: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang
el_gr: Μέλη της ομάδας: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang
it_it: Membri del team: - Leo Fellmann - Etienne Reichenbach - Bernd Schoeller - Martino Trosi - Hong Zhang

source: Application
el_gr: Εφαρμογή
hu: programok
it_it: Applicazione

source: Demo application made by i18n Team ETHZ For bugs, suggestions or other, please write a mail to: es-i18n@origo.ethz.ch
el_gr: αίτηση επίδειξης που υποβάλλεται από i18n την ομάδα ETHZ γιατα ζωύφια, προτάσεις ή άλλη, παρακαλώ γράφει ένα ταχυδρομείο σε: ES- i18n@origo.ethz.ch
hu: demonstràcio programok a hibàknak ajànlatok irjàl neki es-i18n@origo.ethz.ch
it_it: Applicazione di dimostrazione creata dal team per l'internazionalizzazionedel EHT Per segnalare errori, o per dare consigli, puoi scrivere una mail a: es-i18n@origo.ethz.ch

source: arabic
el_gr: αραβικά [ar]
hu: arabul [ar]
it_it: arabo [ar]

source: italian
el_gr: ιταλικά [it]
hu: olaszul [it]
it_it: italiano

source: greek
el_gr: ελληνικά [gr]
hu: görögül
it_it: greco [el]

source: hebrew
el_gr: εβραϊκά [he]
it_it: israeliano [he]

source: japanese
el_gr: ιαπωνικά [ja]
hu: japànul [jp]
it_it: Giapponese [jp]

source: russian
el_gr: ρωσικά [ru]
hu: oroszul [ru]
it_it: russo [ru]

source: chinese
el_gr: κινεζικά [zh_CN
hu: kinaiul [zh]
it_it: cinese [zh]

source: english
el_gr: αγγλικά [en]
hu: angol [en]
it_it: inglese [en]

source: french
el_gr: γαλλικά [fr]
hu: francia [fr]
it_it: francese [fr]

source: hungarian
el_gr: ουγγρικά [hu]
hu: magyarul [hu]
it_it: ungherese [hu]

source: Unknown
el_gr: Αγνωστος
it_it: Sconosciuta

source: Full date-time: $1
el_gr: Πλήρης χρόνος ημερομηνίας: $1
hu: idö és dàtum
it_it: Data e ora: $1

source: Update date and time
el_gr: Ημερομηνία και χρόνος αναπροσαρμογών
hu: ujitani idö és dàtum
it_it: Aggiorna data e ora

source: A hovercraft costs you: $1
el_gr: Ένα hovercraft σας κοστίζει: $1
hu: a hovercraft enyibe kerül: $1
it_it: Un hovercraft costa: $1

source: Buy a hovercraft
el_gr: Αγοράστε ένα hovercraft
hu: vegyél egy hovercraft
it_it: Compra un hovercraft

source: Your have $1 on your bank conto
el_gr: Σας έχει $1 στον τραπεζικό λογαριασμό σας
hu: neked $1 van bank kontodon
it_it: Hai $1 sul tuo conto bancario

source: The mortage rate is $1%
el_gr: Το ποσοστό υποθηκών είναι $1%
it_it: Il tasso ipotecario è $1%

source: File
el_gr: αρχείο

source: Select language
el_gr: Επιλέξτε τη γλώσσα
hu: vàlasz egy nyelvet
it_it: Seleziona la lingua

source: Time: $1
el_gr: χρόνος: $1
hu: idö: $1
it_it: Ora: $1

source: sell hovercraft
el_gr: πωλήστε το hovercraft
hu: eladok egy hovercraft
it_it: vendi un hovercraft

source: Date: $1
el_gr: Ημερομηνία: $1
hu: dàtum
it_it: Data: $1

source: About Dialog
el_gr: Περίπου διάλογος
hu: informàciok
it_it: Dialogo di informazioni

source: OK
el_gr: εντάξει

source: My hovercraft is full of eels
el_gr: Το hovercraft μου είναι πλήρες των χελιών
hu: az én hovercraftom tele van eels
it_it: Il mio hovercraft è pieno di anguille

source: About
el_gr: Περίπου
hu: informàciok
it_it: Informazioni

source: You can sell a hovercraft for $1
el_gr: Μπορείτε να πωλήσετε ένα hovercraft για $1
hu: el tudsz adni eyg hovercraftot enyiér
it_it: Puoi vendere un hovercraft per $1

source: This string is written in the application's sourcecode
el_gr: Greek translation
hu: Not completely translated
it_it: completely translated
